{
  "l1": {
    "id": "l1",
    "title": "Climate Impact",
    "tabs": [
      {
        "name": "Overview",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "paragraph", "text": "<hr>" },
                { "type": "paragraph", "text": "The climate impact of non-CO₂ emissions, which account for two-thirds of aviation's radiative forcing, is heavily influenced by atmospheric chemistry and weather conditions." },
                { "type": "paragraph", "text": "There is significant potential to reduce these effects by avoiding 'climate-sensitive regions' (areas where non-CO₂ impacts are enhanced). This is achieved by planning aircraft trajectories to reroute around these specific atmospheric conditions." },
                { "type": "paragraph", "text": "While promising in theory, flight planning at the individual trajectory scale (micro-scale) faces major obstacles when applied to global traffic scenarios. Air Traffic Management (ATM) is a complex multi-agent system, its collective behavior relies on the interaction between individual trajectories and the wider ATM network (macro-scale)." },
                { "type": "paragraph", "text": "Planning trajectories in isolation introduces several cascading <b>challenges</b>:" },
                { "type": "paragraph", "text": "1. <b>Traffic Displacement</b>:<br> Adopting climatically optimized trajectories evacuates regions sensitive to warming but increases congestion in \"cooling\" climate-sensitive areas." },
                { "type": "paragraph", "text": "2. <b>Increased Complexity</b>:<br> This shift in air traffic flow drastically increases traffic complexity in these newly congested regions." },
                { "type": "paragraph", "text": "3. <b>Safety Hazards</b>:<br> The resulting congestion poses potential safety risks that individual planning cannot foresee." },
                { "type": "paragraph", "text": "Because of these interdependencies, environmental benefits cannot be evaluated by looking at single flights alone. It is essential to conduct analyses at the network level, accounting for the collective behavior of all flights within the system to ensure both environmental mitigation and operational safety." },
                { "type": "paragraph", "text": "<hr>" }
              ]
            }
          ]
        }
      },
      {
        "name": "Input Parameters",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "paragraph", "text": "<hr>" },
                { "type": "paragraph", "text": "The tool allows users to analyze climate impact mitigation strategies by selecting various input parameters that influence the assessment. These parameters include:" },
                { "type": "paragraph", "text": "1. <b>Date</b>:<br>Denotes the date of the programmed flight trajectories." },
                { "type": "paragraph", "text": "2. <b>Data Type</b>:<br>Specifies the type of data to visualize on the map. Options include:" },
                {
                  "type": "list",
                  "items": [
                    "Complexity:<br> Reflects the level of air traffic complexity, typically based on metrics like aircraft density, convergence, or potential conflicts within a defined airspace and time interval.",
                    "Net ATR:<br> To quantify the long-term climate impact of aviation, this metric calculates the projected temperature change in Kelvin (K). It aggregates the diverse effects of multiple emissions species, such as CO2​, NOx​, and H2​O, alongside non-emission factors like Aviation Induced Cloudiness (AIC). The resulting figure provides a net assessment of climate interaction, where positive values denote global warming and negative values reflect a cooling potential.",
                    "Contrails:<br> Measured in Kelvin (K), this metric isolates the specific climate impact attributed to Aviation-Induced Cloudiness (AIC), a phenomenon dominated by persistent contrails. It serves as a flexible indicator that can reflect either the immediate radiative forcing or the resultant Average Temperature Response (ATR) generated by these artificial cloud formations."
                  ]
                },
                { "type": "paragraph", "text": "3. <b>Scale</b>:<br>Defines the optimization scope of the trajectories being visualized:" },
                {
                  "type": "list",
                  "items": [
                    "BAU:<br> Representing the standard baseline scenario, \"Business as Usual\" (BaU) trajectories are optimized with the singular goal of minimizing operational costs. This approach focuses purely on economic efficiency—typically prioritizing fuel and time savings, while deliberately excluding considerations for climate mitigation or the management of air traffic complexity.",
                    "Micro-scale:<br> In this scenario, flight paths are designed with the exclusive objective of minimizing environmental harm. Optimization occurs independently for each individual flight, isolating the specific route that yields the lowest climate impact. By prioritizing the reduction of emissions and radiative forcing above all else, this approach seeks the \"greenest\" possible path without regard for operational costs or network interactions.",
                    "Macro-scale:<br> Moving beyond isolated flight planning, this approach optimizes trajectories collectively at the network level. It explicitly accounts for the dynamic interactions between flights and the resulting air traffic complexity. Consequently, this method seeks a sustainable equilibrium, balancing the drive for climate mitigation with the necessity of maintaining manageable and safe traffic flows."
                  ]
                },
                { "type": "paragraph", "text": "4. <b>Cost</b>:<br> Expressed as a percentage, this metric quantifies the additional financial burden of a selected trajectory compared to the Business as Usual (BaU) baseline. It reflects the operational cost penalty incurred when deviating from the most economic path to achieve other goals. For example, a value of 1% indicates that the alternative route is 1% more expensive than the cost-optimal standard, serving as a key indicator of the economic trade-offs required for climate or network optimization." },
                { "type": "paragraph", "text": "5. <b>Flight Level</b>:<br> Representing the standard aviation metric for vertical positioning, this unit is expressed in Flight Levels (FL), where each increment corresponds to one hundred feet. For example, a value of FL350 translates to a pressure altitude of 35,000 feet. By filtering data to specific Flight Levels, this parameter facilitates precise vertical stratification, allowing researchers to examine how climate indicators or traffic complexity vary across different atmospheric layers."},
                { "type": "paragraph", "text": "6. <b>Time</b>:<br> Formatted in Local Time using the HH:MM standard, this parameter serves as a precise temporal filter for the dataset. It is an essential tool for capturing diurnal variations, enabling the detailed examination of how operational dynamics including traffic complexity, emissions, and climate impact fluctuate throughout the day-night cycle." },
                { "type": "paragraph", "text": "<hr>" }
              ]
            }
          ]
        }
      },
      {
        "name": "Visualizations",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "paragraph", "text": "<hr>" },
                {"type": "paragraph", "text": "<h2>Complexity Interactive Map</h2>"},
                {"type": "paragraph", "text": "<b>What is it?</b><br> The Complexity Map displays the spatial distribution of air traffic complexity across the ATM network for the selected time, flight level, and trajectory scale. The map uses a color scale (colorbar) to represent the intensity of complexity metrics (e.g., density, convergence, conflicts) within predefined geographical cells."},
                {"type": "paragraph", "text": "<b>Importance</b><br> This visualization is crucial for assessing the operational impact of different flight planning strategies (BAU, Micro-scale, Macro-scale). It highlights congested areas and potential safety risks introduced by trajectory changes. High complexity regions indicate areas where Air Traffic Controllers (ATCOs) face increased workload and potential safety hazards."},
                { "type": "paragraph", "text": "<b>Color Range Explanation</b><br> The Complexity Map is presented with a colorbar that typically ranges from a minimum value (e.g., near zero, representing very low complexity) to a maximum value (representing extremely high complexity). The minimum value indicates smooth, uncongested air traffic flow, while the maximum value highlights areas of severe traffic density, convergence, or conflict potential. The colors transition from cool (low complexity) to warm (high complexity) tones."},
                {
                  "type": "image",
                  "src": "src/assets/climate_impact_images/Climate_Impact_Complexity_Map.png",
                  "alt": "Climate impact heatmap",
                  "size": "100%"
                },
                { "type": "paragraph", "text": "<hr>" },
                {"type": "paragraph", "text": "<h2>Contrails Interactive Map</h2>"},
                {"type": "paragraph", "text": "<b>What is it?</b><br> The Contrails Map illustrates the climate impact specifically attributable to Aviation-Induced Cloudiness (AIC), primarily persistent contrails, for the selected parameters. The map uses a color scale and contour lines to show the spatial intensity of the contrail climate effect, measured in Kelvin (K)."},
                {"type": "paragraph", "text": "<b>Importance</b><br> Contrails are a major non-CO₂ climate-forcing agent from aviation. This map allows users to visually identify 'contrail-sensitive regions', areas where conditions are favorable for contrail formation and persistence, leading to a significant warming or cooling effect. It is essential for evaluating the effectiveness of contrail-avoidance strategies under the different trajectory scales."},
                { "type": "paragraph", "text": "<b>Color Range Explanation</b><br> The Contrails Map uses a colorbar and contour lines to display the impact, typically fixed to a symmetrical range, for example, [min, max]."},
                {
                  "type": "list",
                  "items": [
                    "Positive values (Warming):<br> Represent a net warming effect on the climate caused by contrails. These areas are climate-sensitive and should ideally be avoided in climate-optimized routing.",
                    "Negative values (Cooling):<br> Represent a net cooling effect, which is often much less pronounced in real-world scenarios but theoretically possible.",
                    "Values near zero:<br> Indicate regions where the formation or climate impact of contrails is negligible."
                  ]
                },
                {
                  "type": "image",
                  "src": "src/assets/climate_impact_images/Climate_Impact_Contrails_Map.png",
                  "alt": "Climate impact heatmap",
                  "size": "100%"
                },
                { "type": "paragraph", "text": "<hr>" },
                {"type": "paragraph", "text": "<h2>Net ATR Interactive Map</h2>"},
                {"type": "paragraph", "text": "<b>What is it?</b><br> The Net ATR Map visualizes the total, long-term climate impact of all aviation emissions (CO₂, NOₓ, H₂O, AIC/Contrails) across the network, quantified as the Average Temperature Response (ATR) in Kelvin (K). Like the Contrails Map, it uses a color scale and contour lines for spatial visualization."},
                {"type": "paragraph", "text": "<b>Importance</b><br> This is the central visualization for assessing overall climate mitigation. It provides a comprehensive picture of the aggregated warming and cooling effects, helping to identify the most critical 'climate-sensitive regions' that contribute significantly to the net warming potential. Comparing the Net ATR across different scales (BAU, Micro, Macro) directly demonstrates the climate benefit achieved by each optimization strategy."},
                { "type": "paragraph", "text": "<b>Color Range Explanation</b><br> The Net ATR Map's colorbar and contour lines typically span a predefined symmetrical range, such as [min K, max K]."},
                {
                  "type": "list",
                  "items": [
                    "Positive values (Warming):<br> Indicate a net positive radiative forcing, translating to a projected long-term warming of the climate. The higher the positive value, the more detrimental the climate impact of the traffic in that area.",
                    "Negative values (Cooling):<br> Indicate a net cooling effect (negative radiative forcing).",
                    "Values near zero:<br> Indicate areas where the net climate impact is minimal."
                  ]
                },
                {
                  "type": "image",
                  "src": "src/assets/climate_impact_images/Climate_Impact_Net_ATR_Map.png",
                  "alt": "Climate impact heatmap",
                  "size": "100%"
                },
                { "type": "paragraph", "text": "<hr>" },
                {"type": "paragraph", "text": "<h2>Cost-Emissions Comparison Bar Plots</h2>"},
                {"type": "paragraph", "text": "<b>What is it?</b><br> These plots present a comparative summary of the key performance indicators (KPIs) for the selected trajectory Scale (Micro-scale, or Macro-scale) against the baseline BAU scenario. Specifically, these bar charts display aggregated network-wide values, showing the increase or decrease percentages compared to the BAU baseline for different cost values. The KPIs are as follows:"},
                {
                  "type": "list",
                  "items": [
                    "Net ATR:<br> The average network-wide Net Average Temperature Response."
                  ]
                },
                {
                  "type": "image",
                  "src": "src/assets/climate_impact_images/Climate_Impact_Net_ATR_Bar_Plot.png",
                  "alt": "Climate impact heatmap",
                  "size": "30%"
                },
                {
                  "type": "list",
                  "items": [
                    "NOx:<br> The average network-wide climate impact from Nitrogen Oxides."
                  ]
                },
                {
                  "type": "image",
                  "src": "src/assets/climate_impact_images/Climate_Impact_NOx_Bar_Plot.png",
                  "alt": "Climate impact heatmap",
                  "size": "30%"
                },
                {
                  "type": "list",
                  "items": [
                    "H₂O:<br> The average network-wide climate impact from Water Vapor."
                  ]
                },
                {
                  "type": "image",
                  "src": "src/assets/climate_impact_images/Climate_Impact_H2O_Bar_Plot.png",
                  "alt": "Climate impact heatmap",
                  "size": "30%"
                },
                {
                  "type": "list",
                  "items": [
                    "CO₂:<br> The average network-wide climate impact from Carbon Dioxide."
                  ]
                },
                {
                  "type": "image",
                  "src": "src/assets/climate_impact_images/Climate_Impact_CO2_Bar_Plot.png",
                  "alt": "Climate impact heatmap",
                  "size": "30%"
                },
                {
                  "type": "list",
                  "items": [
                    "Contrails:<br> The average network-wide climate impact from Aviation-Induced Cloudiness (AIC)/Contrails."
                  ]
                },
                {
                  "type": "image",
                  "src": "src/assets/climate_impact_images/Climate_Impact_AIC_Bar_Plot.png",
                  "alt": "Climate impact heatmap",
                  "size": "30%"
                },
                { "type": "paragraph", "text": "<b>Importance:</b><br> The Comparison Bar Plots provide a quantitative, easy-to-digest summary of the trade-offs inherent in climate-optimized flight planning. They move beyond the spatial maps to show the system-wide net benefit and cost of the chosen optimization strategy." },
                { "type": "list",
                  "items": [
                    "Cost Efficiency:<br> By displaying the cost increase relative to BAU, users can directly assess the financial implications of climate-optimized routing.",
                    "Climate Benefit:<br> They allow the user to immediately compare the net climate benefit (lower Net ATR, NOx, H2O, CO2, and Contrails, often shown as a decrease in % impact) achieved by Micro-scale and Macro-scale planning against the cost-only optimized BAU.",
                    "Complexity:<br> Crucially, they illustrate the operational feasibility (Complexity) of each strategy, highlighting how Macro-scale optimization successfully reduces the complexity spike associated with the purely climate-driven Micro-scale approach (the Complexity bar might show an increase in % compared to BAU). This is the primary tool for demonstrating the balance between environmental and operational goals."
                  ]
                },
                { "type": "paragraph", "text": "<hr>" }
              ]
            }
          ]
        }
      },
      {
        "name": "Analysis Guidelines",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "paragraph", "text": "<hr>" },
                { "type": "paragraph", "text": "<h2>Micro-Scale Trajectories: Prioritizing Individual Flight Climate Optimization</h2>"},
                { "type": "paragraph", "text": "<h3>Climate Impact Mitigation:</h3>" },
                { "type": "paragraph", "text": "Micro-scale trajectories represent the maximum potential for climate benefit. Since each flight is individually optimized to minimize its specific climate impact (primarily measured by lower Net Average Temperature Response (Net ATR) and reduced contrail formation probability), this approach achieves the highest level of sustainability. The fine-grained, localized adjustments to altitude, speed, and lateral path are tailored precisely to instantaneous atmospheric and weather conditions critical for contrail avoidance and fuel efficiency." },
                { "type": "paragraph", "text": "<h3>Air Traffic Management (ATM) Complexity:</h3>" },
                { "type": "paragraph", "text": "The key drawback of this approach is the dramatic increase in air traffic complexity. When every aircraft is executing a highly individualized, dynamically changing trajectory that deviates significantly from conventional, standardized routes, the predictability and structure of the airspace are severely diminished. This can lead to:" },
                { "type": "list",
                  "items": [
                    "<b>Increased Controller Workload</b>:<br> Air traffic controllers must monitor and manage a much larger variety of interactions, requiring more frequent and complex clearances.",
                    "<b>Reduced Separation Margins</b>:<br> Maintaining safe separation between aircraft becomes more challenging, potentially necessitating the establishment of larger minimum separation distances in practice, which could erode some of the efficiency gains.",
                    "<b>System Overload</b>: In high-density airspace, the complexity generated by these independent optimizations could potentially exceed the current or even future projected capacity of air traffic control systems and human operators, raising significant safety and scalability concerns."
                  ]
                },
                { "type": "paragraph", "text": "<hr>" },
                { "type": "paragraph", "text": "<h2>Macro-Scale Trajectories: Balancing System Coordination and Climate Mitigation</h2>"},
                { "type": "paragraph", "text": "Macro-scale trajectories adopt a system-wide optimization perspective. While individual flights are still optimized for sustainability, this optimization is constrained by the need to maintain overall air traffic flow and structure. As a result, the level of climate mitigation achieved is slightly reduced compared to the purely individualized micro-scale approach. This slight reduction is the necessary price paid for operational integration. The benefits still represent a substantial improvement over current practices." },
                { "type": "paragraph", "text": "<h3>Air Traffic Management (ATM) Complexity:</h3>" },
                { "type": "paragraph", "text": "The primary advantage of macro-scale optimization is the significant reduction in ATM complexity. By incorporating system-wide coordination and flow management constraints directly into the optimization process, these trajectories maintain a high degree of predictability and structure in the airspace. This ensures that the resulting air traffic environment is highly comparable to, and in many cases nearly indistinguishable from, the Business as Usual (BAU) or conventional routing environment. This characteristic leads to:" },
                { "type": "list",
                  "items": [
                    "<b>High Operational Feasibility</b>:<br> The system can be integrated into existing ATM infrastructures with minimal disruption, requiring less dramatic overhauls of control procedures and training.",
                    "<b>Maintained System Capacity</b>:<br> The complexity remains within manageable levels, ensuring that the introduction of climate-optimized routing does not inadvertently lead to air traffic congestion or delays due to ATM saturation.",
                    "<b>Scalability</b>: The coordinated nature of the trajectories makes this approach more robust and scalable for implementation across large, interconnected airspace regions."
                  ]
                },
                { "type": "paragraph", "text": "<hr>" }
              ]
            }
          ]
        }
      }
    ]
  },
  "l2": {
    "id": "l2",
    "title": "Emissions",
    "tabs": [
      {
        "name": "Overview",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "heading", "text": "Emissions Overview" },
                { "type": "paragraph", "text": "Visualize emissions overlays for PM2.5, NO2, and O3 across different scenarios. This tool provides transparent PNG overlays aligned to Europe bounds for map blending." }
              ]
            }
          ]
        }
      },
      {
        "name": "Features",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "heading", "text": "Key Features" },
                {
                  "type": "list",
                  "items": [
                    "Multiple pollutant metrics (PM2.5, NO2, O3)",
                    "Scenario comparison (Base vs. Reduction)",
                    "Interactive map with overlay visualization",
                    "Dynamic color bar with value ranges"
                  ]
                }
              ]
            }
          ]
        }
      },
      {
        "name": "Usage",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "heading", "text": "How to Use" },
                {
                  "type": "list",
                  "items": [
                    "<b>Metric:</b> Select PM2.5, NO2, or O3",
                    "<b>Case:</b> Choose Base or 10% Reduction scenario",
                    "View the overlay on the interactive map"
                  ]
                }
              ]
            }
          ]
        }
      }
    ]
  },
  "l3": {
    "id": "l3",
    "title": "Atmospheric Pollution",
    "tabs": [
      {
        "name": "Overview",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "heading", "text": "Atmospheric Pollution Overview" },
                { "type": "paragraph", "text": "Assess air quality and model the dispersion of atmospheric pollutants over wide areas. This tool embeds the Air Portal for comprehensive pollution analysis." }
              ]
            }
          ]
        }
      },
      {
        "name": "Features",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "heading", "text": "Key Features" },
                {
                  "type": "list",
                  "items": [
                    "Real-time and historical air quality data",
                    "Multiple pollutant visualization (NO₂, PM₁₀, O₃, SO₂, CO)",
                    "Spatial and temporal pattern analysis",
                    "Regulatory threshold tracking"
                  ]
                }
              ]
            }
          ]
        }
      },
      {
        "name": "Usage",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "heading", "text": "How to Use" },
                {
                  "type": "list",
                  "items": [
                    "Navigate the embedded Air Portal interface",
                    "Select different pollutants using portal controls",
                    "Zoom and pan the map to explore regions",
                    "View detailed metrics and time series data"
                  ]
                }
              ]
            }
          ]
        }
      }
    ]
  },
  "l4": {
    "id": "l4",
    "title": "Optimized Trajectories",
    "tabs": [
      {
        "name": "Overview",
        "content": {
          "sections": [
            {
              "content": [
              ]
            }
          ]
        }
      },
      {
        "name": "Features",
        "content": {
          "sections": [
            {
              "content": [
              ]
            }
          ]
        }
      },
      {
        "name": "Usage",
        "content": {
          "sections": [
            {
              "content": [
              ]
            }
          ]
        }
      }
    ]
  },
  "s1": {
    "id": "s1",
    "title": "Noise Assessment",
    "tabs": [
      {
        "name": "Overview",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "heading", "text": "Noise Assessment Overview" },
                { "type": "paragraph", "text": "Evaluate and map noise levels for small sites, buildings, or local environments. Explore noise assessment data interactively with multiple parameters." }
              ]
            }
          ]
        }
      },
      {
        "name": "Features",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "heading", "text": "Key Features" },
                {
                  "type": "list",
                  "items": [
                    "Interactive noise level visualization",
                    "Multiple metric options (Ambient Noise, Annoyance, HA%, Leq)",
                    "Flight zone and traffic level analysis",
                    "Custom color scale for noise intensity"
                  ]
                }
              ]
            }
          ]
        }
      },
      {
        "name": "Usage",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "heading", "text": "How to Use" },
                {
                  "type": "list",
                  "items": [
                    "<b>City:</b> Select the city dataset",
                    "<b>Time:</b> Choose time of day",
                    "<b>Flight Zones:</b> Restricted or Unrestricted",
                    "<b>Flights Per Hour:</b> Select traffic level",
                    "<b>Metric:</b> Choose noise measurement type"
                  ]
                }
              ]
            }
          ]
        }
      }
    ]
  },
  "s2": {
    "id": "s2",
    "title": "Wind Risk Assessment",
    "tabs": [
      {
        "name": "Overview",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "heading", "text": "Wind Risk Assessment Overview" },
                { "type": "paragraph", "text": "Analyze wind patterns and potential risks for small-scale sites. Leverages high-resolution wind simulation datasets for actionable insights." }
              ]
            }
          ]
        }
      },
      {
        "name": "Features",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "heading", "text": "Key Features" },
                {
                  "type": "list",
                  "items": [
                    "Multiple Levels of Detail (LoD)",
                    "Wind speed and turbulence visualization",
                    "Interactive wind direction knob",
                    "Multiple altitude analysis",
                    "Dynamic color-coded heatmaps"
                  ]
                }
              ]
            }
          ]
        }
      },
      {
        "name": "Usage",
        "content": {
          "sections": [
            {
              "content": [
                { "type": "heading", "text": "How to Use" },
                {
                  "type": "list",
                  "items": [
                    "<b>Level of Detail:</b> Select spatial resolution",
                    "<b>City:</b> Choose city or campus",
                    "<b>Parameter:</b> Wind Speed or Turbulence Level",
                    "<b>Altitude:</b> Select height above ground",
                    "<b>Wind Direction:</b> Adjust using interactive knob"
                  ]
                }
              ]
            }
          ]
        }
      }
    ]
  }
}
